src/DataProcessors/ФормированиеПлатежныхДокументовПоВзносамВФонды/ФормированиеПлатежныхДокументовПоВзносамВФонды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеПлатежныхДокументовПоВзносамВФонды</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНачисления</name>
    <type>
      <types>DocumentRef.ЗарплатаКВыплатеОрганизаций</types>
      <types>DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыНачисления</name>
    <attributes>
      <name>Ведомость</name>
      <type>
        <types>DocumentRef.ЗарплатаКВыплатеОрганизаций</types>
        <types>DocumentRef.НачислениеКоммунальногоНалога</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Платежки</name>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Платежка</name>
      <type>
        <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеДокумета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКонтрагента</name>
      <comment>(Общ) Банковский счет контрагента</comment>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Налоги</name>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Налог</name>
      <type>
        <types>CatalogRef.Налоги</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяНалоговойДекларации</name>
      <type>
        <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
      </type>
    </attributes>
    <attributes>
      <name>Ведомость</name>
      <type>
        <types>DocumentRef.ЗарплатаКВыплатеОрганизаций</types>
        <types>DocumentRef.НачислениеКоммунальногоНалога</types>
      </type>
    </attributes>
    <attributes>
      <name>Платежка</name>
      <type>
        <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКонтрагента</name>
      <comment>(Общ) Банковский счет контрагента</comment>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/Documents/НачислениеКоммунальногоНалога/НачислениеКоммунальногоНалога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеКоммунальногоНалога</name>
  <registerRecords>AccumulationRegister.НезавершенноеПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатратРегл</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬНезавершенноеПроизводствоНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.НезавершенноеПроизводствоБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.УДАЛИТЬЗатратыНалоговыйУчет</registerRecords>
  <registerRecords>AccountingRegister.Налоговый</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыБухгалтерскийУчет</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СреднесписочнаяЧисленность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБухгалтерскомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВНалоговомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУправленческомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтражениеВУчете</name>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоКт1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоКт2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоКт3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяВаловыхРасходов</name>
      <type>
        <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначение</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <comment>(Упр) </comment>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <comment>(Регл) </comment>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <comment>(Упр) </comment>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРаспределенияЗатратНаВыпуск</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.СпособыРаспределенияЗатратНаВыпуск</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Налоги/Налоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Налоги</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВзносыФОТ</name>
      <description>Взносы на ФОТ</description>
    </items>
    <items>
      <name>Взносы</name>
      <description>Взносы работников из зарплаты</description>
    </items>
    <items>
      <name>ЕдиныйНалог</name>
      <description>Единый налог</description>
    </items>
    <items>
      <name>МестныеНалоги</name>
      <description>Местные налоги</description>
    </items>
    <items>
      <name>ПенсионныйПрочие</name>
      <description>Пенсионный прочие</description>
    </items>
  </predefined>
  <attributes>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ФормированиеПлатежныхДокументовПоВзносамВФонды/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит автозаполнение табличной части РКО
//
Процедура Автозаполнение() Экспорт
	
	Если ДокументыНачисления.Количество()= 0 Тогда
		#Если Клиент Тогда
		Предупреждение("Необходимо выбрать ведомости, по которойым будут формироваться платежки!");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	АвтозаполнениеВедомость();
	
КонецПроцедуры	
	
// Производит автозаполнение табличной части РКО
//
Процедура АвтозаполнениеВедомость() Экспорт
		
	
	Запрос = Новый Запрос;    
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("парамВедомости", ДокументыНачисления.ВыгрузитьКолонку("Ведомость"));
	
	//	ВТНалоги
	Если Истина Тогда
		//	Описание:
		//      осноная часть запроса, тут получим даные для проведения
		// 
		ТекстЗапросаВТ = "
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		Основной.Ссылка						КАК Ссылка,
		|		Основной.Ссылка.Организация			КАК Организация,
		|		Основной.Налог						КАК Налог,
		|		Основной.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
		|		СУММА( Основной.Результат )			КАК Результат
		|ПОМЕСТИТЬ ВТНалоги	
		|   ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.Взносы КАК Основной
		|	ГДЕ Основной.Ссылка в (&парамВедомости)
		|       И Основной.Результат <> 0
		|	СГРУППИРОВАТЬ ПО
		|		Основной.Ссылка,
		|		Основной.Налог,
		|		Основной.СтатьяНалоговойдекларации
		|
		|   ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ 
		|		Основной.Ссылка						КАК Ссылка,
		|		Основной.Ссылка.Организация			КАК Организация,
		|		Основной.Налог						КАК Налог,
		|		Основной.СтатьяНалоговойдекларации	КАК СтатьяНалоговойдекларации,
		|		СУММА( Основной.Результат )		КАК Результат
		|   ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.ВзносыФОТ КАК Основной
		|	ГДЕ Основной.Ссылка в (&парамВедомости)
		|       И Основной.Результат <> 0
		|	СГРУППИРОВАТЬ ПО
		|		Основной.Ссылка,
		|		Основной.Налог,
		|		Основной.СтатьяНалоговойдекларации
		|
		|   ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ 
		|		Основной.Ссылка						КАК Ссылка,
		|		Основной.Ссылка.Организация			КАК Организация,
		|		""""								КАК Налог,
		|		""""								КАК СтатьяНалоговойдекларации,
		|		СУММА( Основной.Налог )			КАК Результат
		|   ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК Основной
		|	ГДЕ Основной.Ссылка в (&парамВедомости)
		|       И Основной.Налог <> 0
		|	СГРУППИРОВАТЬ ПО
		|		Основной.Ссылка
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		Основной.Ссылка						КАК Ссылка,
		|		Основной.Ссылка.Организация			КАК Организация,
		|		&КоммунальныйНалог					КАК Налог,
		|		Основной.СтатьяВаловыхРасходов		КАК СтатьяНалоговойДекларации,
		|		Сумма(Основной.Сумма)				КАК Результат
		|	ИЗ	Документ.НачислениеКоммунальногоНалога.ОтражениеВУчете КАК Основной
		|	ГДЕ Основной.Ссылка в (&парамВедомости)
		|	СГРУППИРОВАТЬ ПО
		|		Основной.Ссылка,
		|		Основной.СтатьяВаловыхРасходов
		|";
		Запрос.Текст = ТекстЗапросаВТ;
		Запрос.УстановитьПараметр("КоммунальныйНалог",Справочники.Налоги.КоммунальныйНалог);
		Запрос.Выполнить();
		ТекстЗапросаВТНалоги = "ВТНалоги";
	КонецЕсли;
	
	ТекстЗапроса = "	       
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
	|			ТОГДА Параметры.СчетУчета	
	|			ИНАЧЕ ПараметрыСтрогие.СчетУчета	
	|	КОНЕЦ	                                КАК СчетУчета,
	|	Начисления.Ссылка						КАК Ведомость,
	|	Начисления.Налог						КАК Налог,
	|	Начисления.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
	|	Начисления.Результат					КАК Сумма,
	|	ЕСТЬNULL(ПлатежноеПоручение.Ссылка, ЗНАЧЕНИЕ(Документ.ПлатежноеПоручениеИсходящее.ПустаяСсылка)) КАК Платежка,
	|	НЕ ЕСТЬNULL(ПлатежноеПоручение.Ссылка.Проведен, ЛОЖЬ) КАК Отметка,
	|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
	|			ТОГДА Параметры.Контрагент	
	|			ИНАЧЕ ПараметрыСтрогие.Контрагент	
	|	КОНЕЦ	                                КАК Контрагент,
	|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
	|			ТОГДА Параметры.СчетКонтрагента	
	|			ИНАЧЕ ПараметрыСтрогие.СчетКонтрагента	
	|	КОНЕЦ	                                КАК СчетКонтрагента
	|ИЗ ВТНалоги КАК Начисления
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ  (" + ПроведениеРасчетов.ПолучитьПараметрыПлатежекПоВзносамВФонды(Организация) + ") КАК ПараметрыСтрогие
	|	ПО Начисления.Организация = ПараметрыСтрогие.Организация
	|	И Начисления.СтатьяНалоговойДекларации = ПараметрыСтрогие.СтатьяНалоговойДекларации
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ (" + ПроведениеРасчетов.ПолучитьПараметрыПлатежекПоВзносамВФонды(Организация) + ") КАК Параметры
	|ПО		Начисления.Организация = Параметры.Организация
	|    И	(Параметры.СтатьяНалоговойдекларации = ЗНАЧЕНИЕ(Справочник.СтатьиНалоговыхдеклараций.ПустаяСсылка) И Начисления.Налог = """"
	|    ИЛИ	Начисления.СтатьяНалоговойдекларации.Родитель = Параметры.СтатьяНалоговойдекларации)
	|
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеИсходящее.ПеречислениеНалогов КАК ПлатежноеПоручение
 	|ПО		Начисления.Ссылка = ПлатежноеПоручение.Ведомость
 	|	И ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
 	|			ТОГДА Параметры.СчетУчета	
 	|			ИНАЧЕ ПараметрыСтрогие.СчетУчета	
 	|	КОНЕЦ	                                = ПлатежноеПоручение.Ссылка.СчетУчетаРасчетовСКонтрагентом
 	|	И	(ПлатежноеПоручение.СубконтоДт1 = ЗНАЧЕНИЕ(Справочник.налоги.ПустаяСсылка) И Начисления.Налог = """"
 	|	ИЛИ	Начисления.Налог = ПлатежноеПоручение.СубконтоДт1
 	|	И	Начисления.СтатьяНалоговойДекларации = ПлатежноеПоручение.СубконтоДт2)
 	|
	|
	|ИТОГИ СУММА(Сумма) ПО
	|	СчетУчета, Контрагент, СчетКонтрагента
	|
	|";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Организация", Организация);


	ВыборкаПоСчетуУчета =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСчетуУчета.Следующий() Цикл
		ВыборкаПоКонтрагент =  ВыборкаПоСчетуУчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоКонтрагент.Следующий() Цикл
			ВыборкаПоСчетКонтрагента = ВыборкаПоКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоСчетКонтрагента.Следующий() Цикл
				
				СтрПлатежки = Платежки.Добавить();
				СтрПлатежки.СчетУчета 		= ВыборкаПоСчетКонтрагента.СчетУчета;
				СтрПлатежки.Контрагент		= ВыборкаПоСчетКонтрагента.Контрагент;
				СтрПлатежки.СчетКонтрагента = ВыборкаПоСчетКонтрагента.СчетКонтрагента;
				ИтогСум = 0;
				
				ВыборкаПоНалогам =  ВыборкаПоСчетКонтрагента.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока ВыборкаПоНалогам.Следующий() Цикл
					СтрПлатежки.Платежка		= ВыборкаПоНалогам.Платежка;
					СтрПлатежки.Отметка			= ВыборкаПоНалогам.Отметка;
					
					СтрНалоги = Налоги.Добавить();
					СтрНалоги.СчетУчета 				= ВыборкаПоНалогам.СчетУчета;
					Сум     		= ВыборкаПоНалогам.Сумма;
					Сум = Окр(Сум,2) + ?(Сум-Окр(Сум,2)>0, 0.01, 0); // "случайная" копейка
					ИтогСум = ИтогСум + Сум;
					СтрНалоги.Сумма     				= Сум;
					СтрНалоги.Налог						= ВыборкаПоНалогам.Налог;
					СтрНалоги.СтатьяНалоговойДекларации	= ВыборкаПоНалогам.СтатьяНалоговойДекларации;
					СтрНалоги.Ведомость					= ВыборкаПоНалогам.Ведомость;
					СтрНалоги.Контрагент		= ВыборкаПоСчетКонтрагента.Контрагент;
					СтрНалоги.СчетКонтрагента = ВыборкаПоСчетКонтрагента.СчетКонтрагента;
					
					СтрНалоги.Платежка					= ВыборкаПоНалогам.Платежка;
				КонецЦикла;
				СтрПлатежки.Сумма  = ИтогСум;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Формирует номер платежного поручения в пределах расчетного счета
//
Функция УстановитьНомерПоручения(ППИ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(ППИ.Дата));
	Запрос.УстановитьПараметр("ДатаКонцаГода", КонецГода(ППИ.Дата));
	Запрос.УстановитьПараметр("Организация", ППИ.Организация);
	Запрос.УстановитьПараметр("СчетОрганизации", ППИ.СчетОрганизации);
	

	Запрос.Текст =
	"ВЫБРАТЬ
	|	НомерПоручения КАК НомерПоручения
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручение
	|
	|ГДЕ
	|	ПлатежноеПоручение.Организация = &Организация
	|	И ПлатежноеПоручение.СчетОрганизации = &СчетОрганизации
	|	И ПлатежноеПоручение.Дата >= &ДатаНачалаГода
	|	И ПлатежноеПоручение.Дата <= &ДатаКонцаГода";

	СписокПлатежек = Запрос.Выполнить().Выбрать();
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	 
	ТаблицаЗначений.Колонки.Добавить("Номер"); 
	ТаблицаЗначений.Колонки.Добавить("Длина"); 

	Пока СписокПлатежек.Следующий() Цикл
		НоваяСтрока = ТаблицаЗначений.Добавить(); 
		НоваяСтрока.Номер = СписокПлатежек.НомерПоручения; 
		НоваяСтрока.Длина = СтрДлина(СписокПлатежек.НомерПоручения); 
	КонецЦикла;
	
	ТаблицаЗначений.Сортировать("Длина Убыв, Номер Убыв");
	
	Попытка
		НомерПорученияЧисло = Число(ТаблицаЗначений[0].Номер) + 1;
		НомерПоручения = Формат(НомерПорученияЧисло, "ЧГ=0");
	Исключение
		НомерПоручения = 1;
	КонецПопытки;
	
	Возврат НомерПоручения;
	
КонецФункции
